/******************************************************************************/
/* src/main.c                                                                 */
/*                                                                 2018/09/09 */
/* Copyright (C) 2018 Mochi.                                                  */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 共通ヘッダ */
#include <stdbool.h>
#include <string.h>
#include <kernel/library.h>

/* モジュールヘッダ */
#include "Vram.h"


/******************************************************************************/
/* ローカル関数定義                                                           */
/******************************************************************************/
void main( void )
{
    char     buffer[ MK_MSG_SIZE_MAX + 1 ]; /* 受信メッセージバッファ */
    int32_t  size;                          /* 受信メッセージサイズ   */
    uint32_t errNo;                         /* エラー番号             */
    
    /* 初期化 */
    memset( buffer, 0, sizeof ( buffer ) );
    size  = MK_MSG_RET_FAILURE;
    errNo = MK_MSG_ERR_NONE;
    
    /* VRAM初期化 */
    VramInit();
    
    /* メインループ */
    while ( true ) {
        /* メッセージ受信 */
        size = MkMsgReceive( MK_CONFIG_TASKID_NULL,     /* タスクID           */
                             buffer,                    /* メッセージバッファ */
                             MK_MSG_SIZE_MAX,           /* バッファサイズ     */
                             &errNo                 );  /* エラー番号         */
        
        /* メッセージ受信結果判定 */
        if ( size == MK_MSG_RET_FAILURE ) {
            /* 失敗 */
            
            continue;
        }
        
        /* VRAM書き込み */
        VramWrite( buffer, size );
    }
}
/******************************************************************************/
