/******************************************************************************/
/* src/drv-vga.h                                                              */
/*                                                                 2018/10/13 */
/* Copyright (C) 2018 Mochi.                                                  */
/******************************************************************************/
#ifndef DRVVGA_H
#define DRVVGA_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 共通ヘッダ */
#include <stddef.h>
#include <stdint.h>


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/* 機能ID */
#define DRVVGA_FUNC_WRITE ( 0x00000001 )    /* VRAM書込み */

/* メッセージヘッダ */
typedef struct {
    uint32_t funcId;    /**< 機能ID   */
    size_t   length;    /**< データ長 */
} DrvVgaMsgHdr_t;

/* VRAM書込みメッセージ */
typedef struct {
    DrvVgaMsgHdr_t header;  /**< メッセージヘッダ   */
    uint32_t       index;   /**< 書込みインデックス */
    size_t         size;    /**< データサイズ       */
    uint8_t        data[];  /**< 書込みデータ       */
} DrvVgaMsgWrite_t;


/******************************************************************************/
#endif
